RIOT-OS/RIOT/cpu/psoc5lp/boot/CyLib.h
/*******************************************************************************
* External 32kHz Crystal Oscillator API Constants
*******************************************************************************/
#define CY_XTAL32K_ANA_STAT             (0x20u)

#define CY_CLK_XTAL32_CR_LPM            (0x02u)
#define CY_CLK_XTAL32_CR_EN             (0x01u)
#if(CY_PSOC3)
    #define CY_CLK_XTAL32_CR_PDBEN      (0x04u)
#endif  /* (CY_PSOC3) */

#define CY_CLK_XTAL32_TR_MASK           (0x07u)
#define CY_CLK_XTAL32_TR_STARTUP        (0x03u)
#define CY_CLK_XTAL32_TR_HIGH_POWER     (0x06u)
#define CY_CLK_XTAL32_TR_LOW_POWER      (0x01u)
#define CY_CLK_XTAL32_TR_POWERDOWN      (0x00u)

#define CY_CLK_XTAL32_TST_DEFAULT       (0xF3u)

#define CY_CLK_XTAL32_CFG_LP_DEFAULT    (0x04u)
#define CY_CLK_XTAL32_CFG_LP_LOWPOWER   (0x08u)
#define CY_CLK_XTAL32_CFG_LP_MASK       (0x0Cu)

#define CY_CLK_XTAL32_CFG_LP_ALLOW      (0x80u)


/*******************************************************************************
* External MHz Crystal Oscillator API Constants
*******************************************************************************/
#define CY_CLK_XMHZ_FTW_INTERVAL        (24u)
#define CY_CLK_XMHZ_MIN_TIMEOUT         (130u)

#define CY_CLK_XMHZ_CSR_ENABLE          (0x01u)
#define CY_CLK_XMHZ_CSR_XERR            (0x80u)
#define CY_CLK_XMHZ_CSR_XFB             (0x04u)
#define CY_CLK_XMHZ_CSR_XPROT           (0x40u)

#define CY_CLK_XMHZ_CFG0_XCFG_MASK      (0x1Fu)
#define CY_CLK_XMHZ_CFG1_VREF_FB_MASK   (0x0Fu)
#define CY_CLK_XMHZ_CFG1_VREF_WD_MASK   (0x70u)


/*******************************************************************************
* Watchdog Timer API Constants
*******************************************************************************/
#define CYWDT_2_TICKS               (0x0u)     /*    4 -    6 ms */
#define CYWDT_16_TICKS              (0x1u)     /*   32 -   48 ms */
#define CYWDT_128_TICKS             (0x2u)     /*  256 -  384 ms */
#define CYWDT_1024_TICKS            (0x3u)     /* 2048 - 3072 ms */

#define CYWDT_LPMODE_NOCHANGE       (0x00u)
#define CYWDT_LPMODE_MAXINTER       (0x01u)
#define CYWDT_LPMODE_DISABLED       (0x03u)

#define CY_WDT_CFG_INTERVAL_MASK    (0x03u)
#define CY_WDT_CFG_CTW_RESET        (0x80u)
#define CY_WDT_CFG_LPMODE_SHIFT     (5u)
#define CY_WDT_CFG_LPMODE_MASK      (0x60u)
#define CY_WDT_CFG_WDR_EN           (0x10u)
#define CY_WDT_CFG_CLEAR_ALL        (0x00u)
#define CY_WDT_CR_FEED              (0x01u)


/*******************************************************************************
*    Voltage Detection API Constants
*******************************************************************************/

#define CY_VD_LVID_EN                (0x01u)
#define CY_VD_LVIA_EN                (0x02u)
#define CY_VD_HVIA_EN                (0x04u)

#define CY_VD_PRESD_EN               (0x40u)
#define CY_VD_PRESA_EN               (0x80u)

#define CY_VD_LVID                   (0x01u)
#define CY_VD_LVIA                   (0x02u)
#define CY_VD_HVIA                   (0x04u)

#define CY_VD_LVI_TRIP_LVID_MASK     (0x0Fu)


/*******************************************************************************
*    Variable VDDA API Constants
*******************************************************************************/
#if(CYDEV_VARIABLE_VDDA == 1)

    /* Active Power Mode Configuration Register 9 */
    #define CY_LIB_ACT_CFG9_SWCAP0_EN        (0x01u)
    #define CY_LIB_ACT_CFG9_SWCAP1_EN        (0x02u)
    #define CY_LIB_ACT_CFG9_SWCAP2_EN        (0x04u)
    #define CY_LIB_ACT_CFG9_SWCAP3_EN        (0x08u)
    #define CY_LIB_ACT_CFG9_SWCAPS_MASK      (0x0Fu)

    /* Switched Cap Miscellaneous Control Register */
    #define CY_LIB_SC_MISC_PUMP_FORCE        (0x20u)

    /* Switched Capacitor 0 Boost Clock Selection Register */
    #define CY_LIB_SC_BST_CLK_EN             (0x08u)
    #define CY_LIB_SC_BST_CLK_INDEX_MASK     (0xF8u)

#endif  /* (CYDEV_VARIABLE_VDDA == 1) */


/*******************************************************************************
* Clock Distribution API Constants
*******************************************************************************/
#define CY_LIB_CLKDIST_AMASK_MASK       (0xF0u)
#define CY_LIB_CLKDIST_DMASK_MASK       (0x00u)
#define CY_LIB_CLKDIST_LD_LOAD          (0x01u)
#define CY_LIB_CLKDIST_BCFG2_MASK       (0x80u)
#define CY_LIB_CLKDIST_MASTERCLK_DIV    (7u)
#define CY_LIB_CLKDIST_BCFG2_SSS        (0x40u)
#define CY_LIB_CLKDIST_MSTR1_SRC_MASK   (0xFCu)
#define CY_LIB_FASTCLK_IMO_DOUBLER      (0x10u)
#define CY_LIB_FASTCLK_IMO_IMO          (0x20u)
#define CY_LIB_CLKDIST_CR_IMO2X         (0x40u)
#define CY_LIB_FASTCLK_IMO_CR_RANGE_MASK (0xF8u)

#define CY_LIB_CLKDIST_CR_PLL_SCR_MASK  (0xFCu)


/* CyILO_SetPowerMode() */
#define CY_ILO_CONTROL_PD_MODE          (0x10u)
#define CY_ILO_CONTROL_PD_POSITION      (4u)

#define CY_ILO_SOURCE_100K              (0u)
#define CY_ILO_SOURCE_33K               (1u)
#define CY_ILO_SOURCE_1K                (2u)

#define CY_ILO_FAST_START               (0u)
#define CY_ILO_SLOW_START               (1u)

#define CY_ILO_SOURCE_BITS_CLEAR        (0xF3u)
#define CY_ILO_SOURCE_1K_SET            (0x08u)
#define CY_ILO_SOURCE_33K_SET           (0x04u)
#define CY_ILO_SOURCE_100K_SET          (0x00u)

#define CY_MASTER_SOURCE_IMO            (0u)
#define CY_MASTER_SOURCE_PLL            (1u)
#define CY_MASTER_SOURCE_XTAL           (2u)
#define CY_MASTER_SOURCE_DSI            (3u)

#define CY_IMO_SOURCE_IMO               (0u)
#define CY_IMO_SOURCE_XTAL              (1u)
#define CY_IMO_SOURCE_DSI               (2u)


/* CyIMO_Start() */
#define CY_LIB_PM_ACT_CFG0_IMO_EN       (0x10u)
#define CY_LIB_PM_STBY_CFG0_IMO_EN      (0x10u)
#define CY_LIB_CLK_IMO_FTW_TIMEOUT      (0x00u)

#define CY_LIB_IMO_3MHZ_VALUE           (0x03u)
#define CY_LIB_IMO_6MHZ_VALUE           (0x01u)
#define CY_LIB_IMO_12MHZ_VALUE          (0x00u)
#define CY_LIB_IMO_24MHZ_VALUE          (0x02u)
#define CY_LIB_IMO_48MHZ_VALUE          (0x04u)
#define CY_LIB_IMO_62MHZ_VALUE          (0x05u)
#define CY_LIB_IMO_74MHZ_VALUE          (0x06u)


