RIOT-OS/RIOT/cpu/psoc5lp/boot/CyLib.h
/* CyIMO_SetFreq() */
#define CY_IMO_FREQ_3MHZ                (0u)
#define CY_IMO_FREQ_6MHZ                (1u)
#define CY_IMO_FREQ_12MHZ               (2u)
#define CY_IMO_FREQ_24MHZ               (3u)
#define CY_IMO_FREQ_48MHZ               (4u)
#define CY_IMO_FREQ_62MHZ               (5u)
#if(CY_PSOC5)
    #define CY_IMO_FREQ_74MHZ           (6u)
#endif  /* (CY_PSOC5) */
#define CY_IMO_FREQ_USB                 (8u)

#define CY_LIB_IMO_USBCLK_ON_SET        (0x40u)


/* CyCpuClk_SetDivider() */
#define CY_LIB_CLKDIST_DIV_POSITION     (4u)
#define CY_LIB_CLKDIST_MSTR1_DIV_MASK   (0x0Fu)


/* CyIMO_SetTrimValue() */
#define CY_LIB_USB_CLK_EN               (0x02u)


/* CyPLL_OUT_SetSource() - parameters */
#define CY_PLL_SOURCE_IMO               (0u)
#define CY_PLL_SOURCE_XTAL              (1u)
#define CY_PLL_SOURCE_DSI               (2u)


/* CyILO_[Start|Stop][1|100K](), CyILO_[Enable|Disable]33K() */
#define CY_LIB_SLOWCLK_ILO_CR0_EN_1KHZ   (0x02u)
#define CY_LIB_SLOWCLK_ILO_CR0_EN_33KHZ  (0x20u)
#define CY_LIB_SLOWCLK_ILO_CR0_EN_100KHZ (0x04u)


/* CyUsbClk_SetSource() */
#define CY_LIB_CLKDIST_UCFG_SRC_SEL_MASK (0x03u)


/* CyUsbClk_SetSource() - parameters */
#define CY_LIB_USB_CLK_IMO2X            (0x00u)
#define CY_LIB_USB_CLK_IMO              (0x01u)
#define CY_LIB_USB_CLK_PLL              (0x02u)
#define CY_LIB_USB_CLK_DSI              (0x03u)


/* CyUSB_PowerOnCheck() */
#define CY_ACT_USB_ENABLED              (0x01u)
#define CY_ALT_ACT_USB_ENABLED          (0x01u)


#if(CY_PSOC5)

    /***************************************************************************
    * Instruction Synchronization Barrier flushes the pipeline in the processor,
    * so that all instructions following the ISB are fetched from cache or
    * memory, after the instruction has been completed.
    ***************************************************************************/

    #if defined(__ARMCC_VERSION)
        #define CY_SYS_ISB       __isb(0x0f)
    #else   /* ASM for GCC & IAR */
        #define CY_SYS_ISB       asm volatile ("isb \n")
    #endif /* (__ARMCC_VERSION) */

#endif /* (CY_PSOC5) */


/***************************************
* Registers
***************************************/


/*******************************************************************************
* System Registers
*******************************************************************************/

/* Software Reset Control Register */
#define CY_LIB_RESET_CR2_REG         (* (reg8 *) CYREG_RESET_CR2)
#define CY_LIB_RESET_CR2_PTR         (  (reg8 *) CYREG_RESET_CR2)

/* Timewheel Configuration Register 0 */
#define CY_LIB_PM_TW_CFG0_REG           (*(reg8 *) CYREG_PM_TW_CFG0)
#define CY_LIB_PM_TW_CFG0_PTR           ( (reg8 *) CYREG_PM_TW_CFG0)

/* Timewheel Configuration Register 2 */
#define CY_LIB_PM_TW_CFG2_REG           (*(reg8 *) CYREG_PM_TW_CFG2)
#define CY_LIB_PM_TW_CFG2_PTR           ( (reg8 *) CYREG_PM_TW_CFG2)

/* USB Configuration Register */
#define CY_LIB_CLKDIST_UCFG_REG         (*(reg8 *) CYREG_CLKDIST_UCFG)
#define CY_LIB_CLKDIST_UCFG_PTR         ( (reg8 *) CYREG_CLKDIST_UCFG)

/* Internal Main Oscillator Trim Register 1 */
#define CY_LIB_IMO_TR1_REG              (*(reg8 *) CYREG_IMO_TR1)
#define CY_LIB_IMO_TR1_PTR              ( (reg8 *) CYREG_IMO_TR1)

/* USB control 1 Register */
#define CY_LIB_USB_CR1_REG              (*(reg8 *) CYREG_USB_CR1 )
#define CY_LIB_USB_CR1_PTR              ( (reg8 *) CYREG_USB_CR1 )

/* Active Power Mode Configuration Register 0 */
#define CY_LIB_PM_ACT_CFG0_REG          (*(reg8 *) CYREG_PM_ACT_CFG0)
#define CY_LIB_PM_ACT_CFG0_PTR          ( (reg8 *) CYREG_PM_ACT_CFG0)

/* Standby Power Mode Configuration Register 0 */
#define CY_LIB_PM_STBY_CFG0_REG          (*(reg8 *) CYREG_PM_STBY_CFG0)
#define CY_LIB_PM_STBY_CFG0_PTR          ( (reg8 *) CYREG_PM_STBY_CFG0)

/* Active Power Mode Configuration Register 5 */
#define CY_LIB_PM_ACT_CFG5_REG              (* (reg8 *) CYREG_PM_ACT_CFG5 )
#define CY_LIB_PM_ACT_CFG5_PTR              (  (reg8 *) CYREG_PM_ACT_CFG5 )

/* Standby Power Mode Configuration Register 5 */
#define CY_LIB_PM_STBY_CFG5_REG             (* (reg8 *) CYREG_PM_STBY_CFG5 )
#define CY_LIB_PM_STBY_CFG5_PTR             (  (reg8 *) CYREG_PM_STBY_CFG5 )

/* CyIMO_SetTrimValue() */
#if(CY_PSOC3)
    #define CY_LIB_TRIM_IMO_3MHZ_PTR         ((void far *) CYREG_FLSHID_CUST_TABLES_IMO_3MHZ)
    #define CY_LIB_TRIM_IMO_6MHZ_PTR         ((void far *) CYREG_FLSHID_CUST_TABLES_IMO_6MHZ)
    #define CY_LIB_TRIM_IMO_12MHZ_PTR        ((void far *) CYREG_FLSHID_CUST_TABLES_IMO_12MHZ)
    #define CY_LIB_TRIM_IMO_24MHZ_PTR        ((void far *) CYREG_FLSHID_CUST_TABLES_IMO_24MHZ)
    #define CY_LIB_TRIM_IMO_67MHZ_PTR        ((void far *) CYREG_FLSHID_CUST_TABLES_IMO_67MHZ)
    #define CY_LIB_TRIM_IMO_80MHZ_PTR        ((void far *) CYREG_FLSHID_CUST_TABLES_IMO_80MHZ)
    #define CY_LIB_TRIM_IMO_USB_PTR          ((void far *) CYREG_FLSHID_CUST_TABLES_IMO_USB)
    #define CY_LIB_TRIM_IMO_TR1_PTR          ((void far *) (CYREG_FLSHID_MFG_CFG_IMO_TR1 + 1u))
 #else
    #define CY_LIB_TRIM_IMO_3MHZ_PTR         ((reg8 *) CYREG_FLSHID_CUST_TABLES_IMO_3MHZ)
    #define CY_LIB_TRIM_IMO_6MHZ_PTR         ((reg8 *) CYREG_FLSHID_CUST_TABLES_IMO_6MHZ)
    #define CY_LIB_TRIM_IMO_12MHZ_PTR        ((reg8 *) CYREG_FLSHID_CUST_TABLES_IMO_12MHZ)
    #define CY_LIB_TRIM_IMO_24MHZ_PTR        ((reg8 *) CYREG_FLSHID_CUST_TABLES_IMO_24MHZ)
    #define CY_LIB_TRIM_IMO_67MHZ_PTR        ((reg8 *) CYREG_FLSHID_CUST_TABLES_IMO_67MHZ)
    #define CY_LIB_TRIM_IMO_80MHZ_PTR        ((reg8 *) CYREG_FLSHID_CUST_TABLES_IMO_80MHZ)
    #define CY_LIB_TRIM_IMO_USB_PTR          ((reg8 *) CYREG_FLSHID_CUST_TABLES_IMO_USB)
    #define CY_LIB_TRIM_IMO_TR1_PTR          ((reg8 *) (CYREG_FLSHID_MFG_CFG_IMO_TR1 + 1u))
#endif  /* (CY_PSOC3) */


/*******************************************************************************
* PLL Registers
*******************************************************************************/

/* PLL Configuration Register 0 */
#define CY_CLK_PLL_CFG0_REG         (*(reg8 *) CYREG_FASTCLK_PLL_CFG0)
#define CY_CLK_PLL_CFG0_PTR         ( (reg8 *) CYREG_FASTCLK_PLL_CFG0)

